In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [4]:
gdp_df = pd.read_csv("../data/un_gdp.csv")

In [5]:
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN
7     Afghanistan  2012  2075.491747              NaN
8     Afghanistan  2011  1904.559799              NaN
9     Afghanistan  2010  1957.029338              NaN

In [6]:
gdp_df.tail(5)

,Country or Area,Year,Value,Value Footnotes
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [7]:
gdp_df = pd.read_csv("../data/un_gdp.csv", skipfooter=2, engine='python')

In [8]:
gdp_df.tail(5)

     Country or Area  Year        Value  Value Footnotes
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [9]:
gdp_df = gdp_df.drop(["Value Footnotes"], axis=1)

In [10]:
gdp_df = gdp_df.rename({"Country or Area": "Country", "Value": "GDP_Per_Capita"}, axis="columns")

In [11]:
print("gdp_df shape: ", gdp_df.shape)
print(gdp_df.dtypes)

gdp_df shape:  (6868, 3)
Country            object
Year                int64
GDP_Per_Capita    float64
dtype: object

In [12]:
gdp_df['Year'] = pd.to_datetime(gdp_df['Year'], format='%Y')

In [13]:
gdp_df.dtypes

Country                   object
Year              datetime64[ns]
GDP_Per_Capita           float64
dtype: object

In [14]:
gdp_df.head()

       Country       Year  GDP_Per_Capita
0  Afghanistan 2019-01-01     2065.036398
1  Afghanistan 2018-01-01     2033.779002
2  Afghanistan 2017-01-01     2058.383832
3  Afghanistan 2016-01-01     2057.062164
4  Afghanistan 2015-01-01     2068.265904

In [15]:
gdp_df['Year'].value_counts() 
# Number of countries increases over the years.

2017-01-01    238
2016-01-01    238
2015-01-01    238
2014-01-01    238
2013-01-01    238
2012-01-01    237
2011-01-01    237
2018-01-01    237
2010-01-01    236
2009-01-01    236
2008-01-01    235
2007-01-01    235
2006-01-01    235
2005-01-01    234
2004-01-01    234
2003-01-01    233
2002-01-01    233
2001-01-01    232
2000-01-01    231
2019-01-01    231
1999-01-01    224
1998-01-01    223
1997-01-01    223
1996-01-01    221
1995-01-01    221
1994-01-01    214
1993-01-01    212
1992-01-01    209
1991-01-01    208
1990-01-01    207
Name: Year, dtype: int64

In [36]:
for x in range(1990,2022):
    tmp_merge = pd.merge(gdp_df[gdp_df['Year'] == str(x) + '-01-01'], gdp_df[gdp_df['Year'] == str(x + 1)  + '-01-01'], on='Country', how='right')
    added_countries = tmp_merge[tmp_merge.GDP_Per_Capita_x.isnull()]['Country'].tolist()
    if (added_countries):
        print("Year added: " + str(x+1), ', '.join(added_countries))

Year added: 1991 Hungary
Year added: 1992 Slovak Republic
Year added: 1993 Cambodia, Estonia, Small states
Year added: 1994 Bosnia and Herzegovina, West Bank and Gaza
Year added: 1995 Croatia, Kuwait, Latvia, Lithuania, Maldives, Moldova, Serbia
Year added: 1997 Montenegro, San Marino
Year added: 1999 Libya
Year added: 2000 CuraÃ§ao, Kosovo, Liberia, Other small states, Palau, Qatar, Timor-Leste
Year added: 2001 SÃ£o TomÃ© and Principe
Year added: 2002 Afghanistan
Year added: 2004 Nauru
Year added: 2006 Cayman Islands
Year added: 2009 Sint Maarten (Dutch part)
Year added: 2011 Turks and Caicos Islands
Year added: 2013 Djibouti